In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {'Name' :['Ahmet','Mehmet','Zeynep','Atil'] , 'Spor' : ['Kosu','Yuzme','Kosu','Basketbol'] , 'Calorie' : [100,200,300,400] }

In [6]:
dataFrame1 = pd.DataFrame(dict1, index= [0,1,2,3])

In [7]:
dataFrame1

     Name       Spor  Calorie
0   Ahmet       Kosu      100
1  Mehmet      Yuzme      200
2  Zeynep       Kosu      300
3    Atil  Basketbol      400

In [8]:
dict2 = {'Name' :['Osman','Levent','Atlas','Fatma'] , 'Spor' : ['Kosu','Yuzme','Kosu','Basketbol'] , 'Calorie' : [200,230,100,340] }

In [15]:
dataFrame2 = pd.DataFrame(dict2, index= [4,5,6,7])

In [16]:
dict3 = {'Name' :['Ayse','Mahmur','Duygu','Nur'] , 'Spor' : ['Kosu','Yuzme','Badminton','Tenis'] , 'Calorie' : [213,210,320,740] }

In [17]:
dataFrame3 = pd.DataFrame(dict3 , index = [8,9,10,11])

In [18]:
dataFrame2

     Name       Spor  Calorie
4   Osman       Kosu      200
5  Levent      Yuzme      230
6   Atlas       Kosu      100
7   Fatma  Basketbol      340

In [19]:
dataFrame3

      Name       Spor  Calorie
8     Ayse       Kosu      213
9   Mahmur      Yuzme      210
10   Duygu  Badminton      320
11     Nur      Tenis      740

## Concatination

In [21]:
pd.concat([dataFrame1,dataFrame2,dataFrame3], axis=0) #if want unite the columns need axis=1

      Name       Spor  Calorie
0    Ahmet       Kosu      100
1   Mehmet      Yuzme      200
2   Zeynep       Kosu      300
3     Atil  Basketbol      400
4    Osman       Kosu      200
5   Levent      Yuzme      230
6    Atlas       Kosu      100
7    Fatma  Basketbol      340
8     Ayse       Kosu      213
9   Mahmur      Yuzme      210
10   Duygu  Badminton      320
11     Nur      Tenis      740

## Merge 
###### need common column

In [24]:
mergedict1 = {
    "İsim": ["Ahmet", "Mehmet", "Zeynep", "Atıl"],
    "Spor": ["kosu", "yüzme", "koşu", "basketbol"]
}

In [29]:
mergeDataFrame1 = pd.DataFrame(mergedict1)

In [25]:
mergedict2 = {
    "İsim": ["Ahmet", "Mehmet", "Zeynep", "Atıl"],
    "Calorie": [100,200,230,300]
}

In [26]:
mergeDataFrame2 = pd.DataFrame(mergedict2)

In [27]:
mergeDataFrame2

     İsim  Calorie
0   Ahmet      100
1  Mehmet      200
2  Zeynep      230
3    Atıl      300

In [31]:
pd.merge(mergeDataFrame1,mergeDataFrame2 ,on='İsim' ) # on has common column name

     İsim       Spor  Calorie
0   Ahmet       kosu      100
1  Mehmet      yüzme      200
2  Zeynep       koşu      230
3    Atıl  basketbol      300

In [45]:
incomeDict = {
    "İsim": ["Ali", "Buse", "Can", "Deniz"],
    "Departman": ["Yazılım", "Satış", "Pazarlama", "Yazılım"],
    "Maas": [200, 300, 400, 500]
}

In [46]:
incomeDataFrame = pd.DataFrame(incomeDict)

In [47]:
incomeDataFrame['Departman'].count()

4

In [39]:
incomeDataFrame['Departman'].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [40]:
incomeDataFrame['Departman'].nunique() #number of unique

3

In [41]:
incomeDataFrame['Departman'].value_counts()

Departman
Yazılım      2
Satış        1
Pazarlama    1
Name: count, dtype: int64

In [52]:
for i in range(len(incomeDataFrame)):
    incomeDataFrame.loc[i, "Maas"] = incomeDataFrame.loc[i, "Maas"] * 2

In [53]:
incomeDataFrame

    İsim  Departman  Maas
0    Ali    Yazılım   400
1   Buse      Satış   600
2    Can  Pazarlama   800
3  Deniz    Yazılım  1000

In [57]:
def bruttenNete(Maas):
  return Maas * 0.5

In [58]:
incomeDataFrame['Maas'].apply(bruttenNete)

0    200.0
1    300.0
2    400.0
3    500.0
Name: Maas, dtype: float64

In [59]:
incomeDataFrame.isnull()

    İsim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [60]:
newData = {'Karakter Sinifi' : ['Southpark','Southpark','Simpson','Simpson'],
           'Karakter Ismi' : ['Cartner','Kenny','Homer','Bart'],
           'Karakter Yas': [9,10,50,20]}

In [61]:
newDataFrame = pd.DataFrame(newData)

In [62]:
newDataFrame

  Karakter Sinifi Karakter Ismi  Karakter Yas
0       Southpark       Cartner             9
1       Southpark         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20

In [63]:
newDataFrame.pivot_table(values = 'Karakter Yas' , index = ['Karakter Sinifi','Karakter Ismi'])

                               Karakter Yas
Karakter Sinifi Karakter Ismi
Simpson         Bart                   20.0
                Homer                  50.0
Southpark       Cartner                 9.0
                Kenny                  10.0

In [64]:
newData2 = {'Karakter Sinifi' : ['Southpark','Southpark','Simpson','Simpson','Simpson'],
           'Karakter Ismi' : ['Cartner','Kenny','Homer','Bart','Bart'],
           'Karakter Yas': [9,10,50,20,10]}

In [65]:
newDataFrame2 = pd.DataFrame(newData2)

In [67]:
newDataFrame2.pivot_table(values = 'Karakter Yas' , index = ['Karakter Sinifi','Karakter Ismi'])

                               Karakter Yas
Karakter Sinifi Karakter Ismi
Simpson         Bart                   15.0
                Homer                  50.0
Southpark       Cartner                 9.0
                Kenny                  10.0

In [70]:
newDataFrame2.pivot_table(values = 'Karakter Yas' , index = ['Karakter Sinifi','Karakter Ismi'], aggfunc=np.sum)

C:\Users\PC\AppData\Local\Temp\ipykernel_17300\2518545480.py:1: FutureWarning: The provided callable <function sum at 0x0000023A5BEE4A40> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  newDataFrame2.pivot_table(values = 'Karakter Yas' , index = ['Karakter Sinifi','Karakter Ismi'], aggfunc=np.sum)

                               Karakter Yas
Karakter Sinifi Karakter Ismi
Simpson         Bart                     30
                Homer                    50
Southpark       Cartner                   9
                Kenny                    10